# CannotPlaceBalusterPatterns Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotPlaceBalusterPatterns Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't place Baluster Patterns
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceBalusterPatterns { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceBalusterPatterns As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceBalusterPatterns {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace